Repository: ConnectionMaster/ubuntu-make
Catalog: po/*.po
Languages: ga

source: # Ubuntu make installation of {}
ga: # Suiteáil Ubuntu de {}

source: * Command '{}':
ga: * Ordú '{}':

source: Deploy and setup developers environment easily on ubuntu
ga: Imscaradh agus socrú timpeallacht forbróirí go héasca ar Ubuntu

source: Note that you can also configure different debug logging behavior using LOG_CFG that points to a log yaml profile.
ga: Tabhair faoi deara gur féidir leat iompar logála dífhabhtaithe éagsúil a chumrú freisin ag baint úsáide as LOG_CFG a dhíríonn ar phróifíl loga yaml.

source: Show this help
ga: Taispeáin an chabhair seo

source: Increase output verbosity (2 levels)
ga: Méadaigh foclaíocht an aschuir (2 leibhéal)

source: Remove specified framework if installed
ga: Bain an creatlach shonraithe má tá sé suiteáilte

source: Print version and exit
ga: Leagan priontála agus scoir

source: Generic IDEs
ga: IDEanna Ginearálacha

source: Pure Eclipse Luna (4.4)
ga: Luna Éclipse Glan (4.4)

source: The Eclipse Luna Integrated Development Environment
ga: Timpeallacht Forbartha Chomhtháite Eclipse Luna

source: Eclipse Luna
ga: Luna Eclipse

source: PyCharm Community Edition
ga: Eagrán Pobail PyCharm

source: PyCharm Educational Edition
ga: Eagrán Oideachais PyCharm

source: PyCharm Professional Edition
ga: Eagrán Gairmiúil PyCharm

source: IntelliJ IDEA Community Edition
ga: Eagrán Pobail IntelliJ IDEA

source: Complex client-side and server-side javascript IDE
ga: IDE javascript casta taobh cliaint agus taobh freastalaí

source: PHP and web development IDE
ga: PHP agus IDE forbartha gréasáin

source: CLion integrated C/C++ IDE
ga: IDE comhtháite C/C++ CLion

source: The Arduino Software Distribution
ga: Dáileadh Bogearraí Arduino

source: The Arduino Software IDE
ga: An IDE Bogearraí Arduino

source: You need to logout and login again for your installation to work
ga: Ní mór duit logáil amach agus logáil isteach arís le go n-oibreoidh do shuiteáil

source: Dartlang Development Environment
ga: Timpeallacht Forbartha Dartlang

source: Dart SDK with editor (not supported upstream anymore)
ga: SDK Dart le heagarthóir (ní thacaítear leis an sruth suas a thuilleadh)

source: Dart SDK (default)
ga: SDK Dart (réamhshocraithe)

source: You need to restart your current shell session for your {} installation to work properly
ga: Ní mór duit do sheisiún sliogáin reatha a atosú le go n-oibreoidh do shuiteáil {} i gceart

source: Rust language
ga: Teanga Rust

source: The official Rust distribution
ga: Dáileadh oifigiúil an Rust

source: The Scala Programming Language
ga: Teanga Chlársceidealaithe Scala

source: Scala compiler and interpreter (default)
ga: Tiomsaitheoir agus léirmhínitheoir Scala (réamhshocraithe)

source: Go language
ga: Teanga Go

source: Google compiler (default)
ga: Tiomsaitheoir Google (réamhshocraithe)

source: Android Development Environment
ga: Timpeallacht Forbartha Android

source: Android Studio (default)
ga: Stiúideo Android (réamhshocraithe)

source: Android Studio
ga: Stiúideo Android

source: Android Studio developer environment
ga: Timpeallacht fhorbróra Stiúideo Android

source: A default framework for category {} was requested where there is none
ga: Iarradh creatlach réamhshocraithe do chatagóir {} nuair nach bhfuil aon cheann ann

source: You can't install that framework on this machine
ga: Ní féidir leat an creatlach sin a shuiteáil ar an meaisín seo

source: You can't remove {} as it isn't installed
ga: Ní féidir leat {} a bhaint mar níl sé suiteáilte

source: If the default framework name isn't provided, destdir should contain a /
ga: Mura gcuirtear ainm an chreata réamhshocraithe ar fáil, ba chóir go mbeadh / sa destdir

source: Remove framework if installed
ga: Bain an creat má tá sé suiteáilte

source: Accept license without prompting
ga: Glac leis an gceadúnas gan iarraidh

source: Web Developer Environment
ga: Timpeallacht Forbróra Gréasáin

source: Firefox Developer Edition
ga: Eagrán Forbróra Firefox

source: Choose language: {}
ga: Roghnaigh teanga: {}

source: Firefox Aurora with Developer tools
ga: Firefox Aurora le huirlisí Forbróra

source: Install in given language without prompting
ga: Suiteáil sa teanga shonraithe gan leid

source: Visual Studio focused on modern web and cloud
ga: Visual Studio dírithe ar an ngréasán agus an scamall nua-aimseartha

source: Games Development Environment
ga: Timpeallacht Forbartha Cluichí

source: Stencyl game developer IDE
ga: IDE forbróra cluichí Stencyl

source: Unity 3D Editor Linux experimental support
ga: Tacaíocht turgnamhach Linux d'Eagarthóir Unity 3D

source: Unity3D Editor
ga: Eagarthóir Unity3D

source: Twine tool for creating interactive and nonlinear stories
ga: Uirlis sreangáin chun scéalta idirghníomhacha agus neamhlíneacha a chruthú

source: No suitable answer provided
ga: Níor tugadh freagra oiriúnach

source: Your entry '{}' isn't an acceptable choice. choices are: {}
ga: Ní rogha inghlactha é d'iontráil '{}'. Is iad na roghanna seo a leanas: {}

source: Your entry '{}' isn't an acceptable choice. choices are: {} and {}
ga: Ní rogha inghlactha é d'iontráil '{}'. Is iad na roghanna seo a leanas: {} agus {}

source: I Accept
ga: Glacaim

source: I don't accept
ga: Ní ghlacaim leis

source: Yes
ga: Tá

source: y
ga: t

source: No
ga: Níl
